starter-kit-org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Org</title>
<!-- 2014-10-13 Mon 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Org</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Starter Kit Org</h2>
<div class="outline-text-2" id="text-1">
<p>
Configuration for the eminently useful <a href="http://orgmode.org/">Org Mode</a>.
</p>

<p>
Org-mode is for keeping notes, maintaining ToDo lists, doing project
planning, and authoring with a fast and effective plain-text system.
Org Mode can be used as a very simple folding outliner or as a complex
GTD system or tool for reproducible research and literate programming.
</p>

<p>
For more information on org-mode check out <a href="http://orgmode.org/worg/">worg</a>, a large Org-mode wiki
which is also <b>implemented using</b> Org-mode and <a href="http://git-scm.com/">git</a>.
</p>
</div>

<div id="outline-container-keybindings" class="outline-3">
<h3 id="keybindings"><a id="sec-1-1" name="sec-1-1"></a>Org-Mode Hook &#x2013; Keybindings</h3>
<div class="outline-text-3" id="text-keybindings">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'org-mode-hook
          (<span style="font-weight: bold;">lambda</span> ()
            (local-set-key <span style="font-style: italic;">"\M-\C-n"</span> 'outline-next-visible-heading)
            (local-set-key <span style="font-style: italic;">"\M-\C-p"</span> 'outline-previous-visible-heading)
            (local-set-key <span style="font-style: italic;">"\M-\C-u"</span> 'outline-up-heading)
            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">table</span>
            (local-set-key <span style="font-style: italic;">"\M-\C-w"</span> 'org-table-copy-region)
            (local-set-key <span style="font-style: italic;">"\M-\C-y"</span> 'org-table-paste-rectangle)
            (local-set-key <span style="font-style: italic;">"\M-\C-l"</span> 'org-table-sort-lines)
            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">display images</span>
            (local-set-key <span style="font-style: italic;">"\M-I"</span> 'org-toggle-iimage-in-org)))
</pre>
</div>
</div>
</div>

<div id="outline-container-speed-keys" class="outline-3">
<h3 id="speed-keys"><a id="sec-1-2" name="sec-1-2"></a>Speed keys</h3>
<div class="outline-text-3" id="text-speed-keys">
<p>
Speed commands enable single-letter commands in Org-mode files when
the point is at the beginning of a headline, or at the beginning of a
code block.
</p>

<p>
See the `=org-speed-commands-default=' variable for a list of the keys
and commands enabled at the beginning of headlines.  All code blocks
are available at the beginning of a code block, the following key
sequence <code>C-c C-v h</code> (bound to `=org-babel-describe-bindings=') will
display a list of the code blocks commands and their related keys.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-use-speed-commands t)
</pre>
</div>
</div>
</div>

<div id="outline-container-babel" class="outline-3">
<h3 id="babel"><a id="sec-1-3" name="sec-1-3"></a>Code blocks</h3>
<div class="outline-text-3" id="text-babel">
<p>
This activates a number of widely used languages, you are encouraged
to activate more languages using the customize interface for the
`=org-babel-load-languages=' variable, or with an elisp form like the
one below.  The customize interface of `=org-babel-load-languages='
contains an up to date list of the currently supported languages.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (sh . t)))
</pre>
</div>

<p>
You are encouraged to add the following to your personal configuration
although it is not added by default as a security precaution.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-confirm-babel-evaluate nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-code-block-fontification" class="outline-3">
<h3 id="code-block-fontification"><a id="sec-1-4" name="sec-1-4"></a>Code block fontification</h3>
<div class="outline-text-3" id="text-code-block-fontification">
<p>
The following displays the contents of code blocks in Org-mode files
using the major-mode of the code.  It also changes the behavior of
<code>TAB</code> to as if it were used in the appropriate major mode.  This means
that reading and editing code form inside of your Org-mode files is
much more like reading and editing of code using its major mode.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)
</pre>
</div>
</div>
</div>

<div id="outline-container-library-of-babel" class="outline-3">
<h3 id="library-of-babel"><a id="sec-1-5" name="sec-1-5"></a>The Library of Babel</h3>
<div class="outline-text-3" id="text-library-of-babel">
<p>
The library of babel contains makes many useful functions available
for use by code blocks in <b>any</b> emacs file.  See the actual
<code>library-of-babel.org</code> (located in the Org-mode <code>contrib/babel</code>
directory) file for information on the functions, and see
<a href="http://orgmode.org/worg/org-contrib/babel/intro.php#library-of-babel">worg:library-of-babel</a> for more usage information.
</p>

<p>
Code blocks can be loaded into the library of babel from any Org-mode
file using the `org-babel-lob-ingest' function.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
